src/Documents/РасходныйКассовыйОрдер/РасходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходныйКассовыйОрдер</name>
  <basedOn>Document.ПоступлениеТоваровИУслуг</basedOn>
  <basedOn>Document.Реализация</basedOn>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходаДенег</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровИУслуг</types>
      <types>DocumentRef.Реализация</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ФинансовыеДанные</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОперацийРасходаДенег/ВидыОперацийРасходаДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходаДенег</name>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаПодотчетнику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаЗаработнойПлаты</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРожденияКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолКлиента</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Documents/РасходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
// Форма документа "РасходныйКассовыйОрдер".
// Обеспечивает:
//   - установку ответственного по умолчанию (текущий пользователь),
//   - динамическое управление типом получателя (контрагент или сотрудник) в зависимости от вида операции,
//   - управление видимостью поля "Договор" (скрыто для зарплатных и подотчетных выплат, а также для покупателей),
//   - проверку, является ли контрагент покупателем, для скрытия договора.

// ============================================================
//  Серверные обработчики и функции
// ============================================================

// При создании нового документа на сервере:
//   - заполняем ответственного текущим пользователем, если не задан,
//   - настраиваем начальную видимость элементов.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    // Заполнение ответственного текущим пользователем
    Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
        Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
    // Установка начальной видимости элементов формы
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// Проверяет, является ли контрагент покупателем.
// Параметры:
//   СсылкаНаКонтрагента – СправочникСсылка.Контрагенты (может быть пустой ссылкой).
// Возвращает:
//   Истина  – если тип контрагента = Покупатель,
//   Ложь    – в противном случае или если ссылка не заполнена.
&НаСервере
Функция КонтрагентПокупатель(СсылкаНаКонтрагента) Экспорт
    Если Не ЗначениеЗаполнено(СсылкаНаКонтрагента) Тогда
        Возврат Ложь;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Контрагенты.ТипКонтрагента = &ТипПокупатель КАК Покупатель
    |ИЗ
    |    Справочник.Контрагенты КАК Контрагенты
    |ГДЕ
    |    Контрагенты.Ссылка = &Ссылка";
    
    Запрос.УстановитьПараметр("Ссылка", СсылкаНаКонтрагента);
    Запрос.УстановитьПараметр("ТипПокупатель", Перечисления.ТипыКонтрагентов.Покупатель);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Покупатель;
    КонецЕсли;
    
    Возврат Ложь;
КонецФункции

// Управляет видимостью элемента "Договор" на сервере.
// Логика:
//   - Выдача подотчетнику или зарплаты → договор скрыт,
//   - Иначе: если получатель – контрагент и он покупатель → скрыт,
//            иначе (поставщик, пусто или сотрудник) → показан.
&НаСервере
Процедура УправлятьВидимостьюЭлементовНаСервере()
    Если Объект.ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику
        Или Объект.ВидОперации = Перечисления.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты Тогда
        Элементы.Договор.Видимость = Ложь;
    Иначе
        Если ЗначениеЗаполнено(Объект.Получатель) И 
            ТипЗнч(Объект.Получатель) = Тип("СправочникСсылка.Контрагенты") Тогда
            ЯвляетсяПокупателем = КонтрагентПокупатель(Объект.Получатель);
            Элементы.Договор.Видимость = Не ЯвляетсяПокупателем;
        Иначе
            Элементы.Договор.Видимость = Истина;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

// ============================================================
//  Клиентские обработчики
// ============================================================

// При открытии формы настраиваем тип получателя и видимость.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    УправлятьТипомПолучателяНаКлиенте();
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// При изменении вида операции перестраиваем тип получателя и видимость.
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
    УправлятьТипомПолучателяНаКлиенте();
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// При изменении получателя обновляем видимость договора.
&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
    УправлятьВидимостьюЭлементовНаСервере();
КонецПроцедуры

// Устанавливает ограничение типа для реквизита "Получатель" в зависимости от вида операции:
//   - Выдача подотчетнику или зарплаты → только справочник "Сотрудники",
//   - Остальные виды операций → только справочник "Контрагенты".
// Если текущее значение не соответствует новому типу, оно сбрасывается.
&НаКлиенте
Процедура УправлятьТипомПолучателяНаКлиенте()
    // В зависимости от вида операции устанавливаем допустимый тип для реквизита Получатель
    Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаПодотчетнику")
        Или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходаДенег.ВыдачаЗаработнойПлаты") Тогда
        // Получатель - Сотрудники
        Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Сотрудники");
        // Очищаем значение, если было неверного типа
        Если Объект.Получатель <> Неопределено И
            ТипЗнч(Объект.Получатель) <> Тип("СправочникСсылка.Сотрудники") Тогда
            Объект.Получатель = Неопределено;
        КонецЕсли;
    Иначе
        // Получатель - Контрагенты
        Элементы.Получатель.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
        Если Объект.Получатель <> Неопределено И
            ТипЗнч(Объект.Получатель) <> Тип("СправочникСсылка.Контрагенты") Тогда
            Объект.Получатель = Неопределено;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
